{
  "blogs": [
    {
      "id": 1,
      "title": "Язык программирования Питон: плюсы и минусы",
      "image": "https://it-blog.ru/wp-content/uploads/2020/05/python1.jpg",
      "content": "Новую профессию нельзя получить сразу: нужно узнать все детали и подводные камни — программирования это тоже касается. Рассказываем, почему языку Python уделяют столько внимания, где и как его применяют, а заодно — и зарплаты разработчиков.",
      "link": "https://checkroi.ru/blog/plyusy-i-minusy-pitona/"
    },
    {
      "id": 2,
      "title": "8 способов нахождения наибольшего общего делителя",
      "image": "https://avatars.mds.yandex.net/i?id=1ab00f2aaa535a6bc5fc8944f650f0ea_l-5215706-images-thumbs&n=13",
      "content": "Эта статья появилась на свет совершенно неожиданно. Мне на глаза случайно попался код вычисления НОД на C#.С первого взгляда мне даже всё понравилось: простенько, лаконичненько и без лишнего выпендрёжа. Однако чем дольше я рассматривал этот код, тем больше возникало сомнений в его эффективности. Я решил сделать маленькое исследование...",
      "link": "https://code-live.ru/post/greatest-common-denominator-algorithms/"
    },
    {
      "id": 3,
      "title": "С++: разбираешься ли ты в управлении памятью?",
      "image": "https://img.freepik.com/premium-photo/nervous-system-in-the-human-brain-is-powered-by-artificial-intelligence-business-and-medical-health-concept-generative-ai_10307-2480.jpg",
      "content": "С большой силой приходит большая ответственность. Это мы, кстати, про управление памятью в C++. Да, язык дает огромную свободу в этом плане, но цена ошибки тоже высока: утечки, сегфолты и бесконечные дебаги. В этом квизе мы проверим, насколько ты разбираешься в управлении памятью и сможешь ли ты избежать типичных ошибок...",
      "link": "https://tproger.ru/quiz/s----razbiraewsya-li-ty-v-upravlenii-pamyatyu-"
    },
    {
      "id": 4,
      "title": "5 классных вещей, которые вы можете освоить с Python",
      "image": "https://avatars.mds.yandex.net/i?id=0b550d4ac8c155581632ec403d5ea41d1ae0d272-5378989-images-thumbs&n=13",
      "content": "Python — универсальный язык программирования. По данным на январь 2023 года, он стал самым популярным согласно рейтингам TIOBE и PYPL. Что можно написать на Python? Всё, что угодно. В этой статье мы расскажем о том, какие интересные программы можно создавать на Питоне...",
      "link": "https://journal.sweb.ru/article/5-klassnyh-veschey-kotorye-vy-mozhete-osvoit-s-python"
    }
  ]
}
